RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_sdp_regs.h
/* Bitfield definition for register: NPKTPTR */
/*
 * NPKTPTR (RW)
 *
 * Next Packet Address Pointer
 */
#define SDP_NPKTPTR_NPKTPTR_MASK (0xFFFFFFFFUL)
#define SDP_NPKTPTR_NPKTPTR_SHIFT (0U)
#define SDP_NPKTPTR_NPKTPTR_SET(x) (((uint32_t)(x) << SDP_NPKTPTR_NPKTPTR_SHIFT) & SDP_NPKTPTR_NPKTPTR_MASK)
#define SDP_NPKTPTR_NPKTPTR_GET(x) (((uint32_t)(x) & SDP_NPKTPTR_NPKTPTR_MASK) >> SDP_NPKTPTR_NPKTPTR_SHIFT)

/* Bitfield definition for register: PKTCTL */
/*
 * PKTTAG (RW)
 *
 * packet tag
 */
#define SDP_PKTCTL_PKTTAG_MASK (0xFF000000UL)
#define SDP_PKTCTL_PKTTAG_SHIFT (24U)
#define SDP_PKTCTL_PKTTAG_SET(x) (((uint32_t)(x) << SDP_PKTCTL_PKTTAG_SHIFT) & SDP_PKTCTL_PKTTAG_MASK)
#define SDP_PKTCTL_PKTTAG_GET(x) (((uint32_t)(x) & SDP_PKTCTL_PKTTAG_MASK) >> SDP_PKTCTL_PKTTAG_SHIFT)

/*
 * CIPHIV (RW)
 *
 * Load Initial Vector for the AES in this packet.
 */
#define SDP_PKTCTL_CIPHIV_MASK (0x40U)
#define SDP_PKTCTL_CIPHIV_SHIFT (6U)
#define SDP_PKTCTL_CIPHIV_SET(x) (((uint32_t)(x) << SDP_PKTCTL_CIPHIV_SHIFT) & SDP_PKTCTL_CIPHIV_MASK)
#define SDP_PKTCTL_CIPHIV_GET(x) (((uint32_t)(x) & SDP_PKTCTL_CIPHIV_MASK) >> SDP_PKTCTL_CIPHIV_SHIFT)

/*
 * HASFNL (RW)
 *
 * Hash Termination packet
 */
#define SDP_PKTCTL_HASFNL_MASK (0x20U)
#define SDP_PKTCTL_HASFNL_SHIFT (5U)
#define SDP_PKTCTL_HASFNL_SET(x) (((uint32_t)(x) << SDP_PKTCTL_HASFNL_SHIFT) & SDP_PKTCTL_HASFNL_MASK)
#define SDP_PKTCTL_HASFNL_GET(x) (((uint32_t)(x) & SDP_PKTCTL_HASFNL_MASK) >> SDP_PKTCTL_HASFNL_SHIFT)

/*
 * HASINI (RW)
 *
 * Hash Initialization packat
 */
#define SDP_PKTCTL_HASINI_MASK (0x10U)
#define SDP_PKTCTL_HASINI_SHIFT (4U)
#define SDP_PKTCTL_HASINI_SET(x) (((uint32_t)(x) << SDP_PKTCTL_HASINI_SHIFT) & SDP_PKTCTL_HASINI_MASK)
#define SDP_PKTCTL_HASINI_GET(x) (((uint32_t)(x) & SDP_PKTCTL_HASINI_MASK) >> SDP_PKTCTL_HASINI_SHIFT)

/*
 * CHAIN (RW)
 *
 * whether the next command pointer register must be loaded into the channel's current descriptor
 * pointer.
 */
#define SDP_PKTCTL_CHAIN_MASK (0x8U)
#define SDP_PKTCTL_CHAIN_SHIFT (3U)
#define SDP_PKTCTL_CHAIN_SET(x) (((uint32_t)(x) << SDP_PKTCTL_CHAIN_SHIFT) & SDP_PKTCTL_CHAIN_MASK)
#define SDP_PKTCTL_CHAIN_GET(x) (((uint32_t)(x) & SDP_PKTCTL_CHAIN_MASK) >> SDP_PKTCTL_CHAIN_SHIFT)

/*
 * DCRSEMA (RW)
 *
 * whether the channel's semaphore must be decremented at the end of the current operation.
 * When the semaphore reaches a value of zero, no more operations are issued from the channel.
 */
#define SDP_PKTCTL_DCRSEMA_MASK (0x4U)
#define SDP_PKTCTL_DCRSEMA_SHIFT (2U)
#define SDP_PKTCTL_DCRSEMA_SET(x) (((uint32_t)(x) << SDP_PKTCTL_DCRSEMA_SHIFT) & SDP_PKTCTL_DCRSEMA_MASK)
#define SDP_PKTCTL_DCRSEMA_GET(x) (((uint32_t)(x) & SDP_PKTCTL_DCRSEMA_MASK) >> SDP_PKTCTL_DCRSEMA_SHIFT)

/*
 * PKTINT (RW)
 *
 * Reflects whether the channel must issue an interrupt upon the completion of the packet
 */
#define SDP_PKTCTL_PKTINT_MASK (0x2U)
#define SDP_PKTCTL_PKTINT_SHIFT (1U)
#define SDP_PKTCTL_PKTINT_SET(x) (((uint32_t)(x) << SDP_PKTCTL_PKTINT_SHIFT) & SDP_PKTCTL_PKTINT_MASK)
#define SDP_PKTCTL_PKTINT_GET(x) (((uint32_t)(x) & SDP_PKTCTL_PKTINT_MASK) >> SDP_PKTCTL_PKTINT_SHIFT)

/* Bitfield definition for register: PKTSRC */
/*
 * PKTSRC (RW)
 *
 * Packet Memory Source Address
 */
#define SDP_PKTSRC_PKTSRC_MASK (0xFFFFFFFFUL)
#define SDP_PKTSRC_PKTSRC_SHIFT (0U)
#define SDP_PKTSRC_PKTSRC_SET(x) (((uint32_t)(x) << SDP_PKTSRC_PKTSRC_SHIFT) & SDP_PKTSRC_PKTSRC_MASK)
#define SDP_PKTSRC_PKTSRC_GET(x) (((uint32_t)(x) & SDP_PKTSRC_PKTSRC_MASK) >> SDP_PKTSRC_PKTSRC_SHIFT)

/* Bitfield definition for register: PKTDST */
/*
 * PKTDST (RW)
 *
 * Packet Memory Destination Address
 */
#define SDP_PKTDST_PKTDST_MASK (0xFFFFFFFFUL)
#define SDP_PKTDST_PKTDST_SHIFT (0U)
#define SDP_PKTDST_PKTDST_SET(x) (((uint32_t)(x) << SDP_PKTDST_PKTDST_SHIFT) & SDP_PKTDST_PKTDST_MASK)
#define SDP_PKTDST_PKTDST_GET(x) (((uint32_t)(x) & SDP_PKTDST_PKTDST_MASK) >> SDP_PKTDST_PKTDST_SHIFT)

/* Bitfield definition for register: PKTBUF */
/*
 * PKTBUF (RW)
 *
 */
#define SDP_PKTBUF_PKTBUF_MASK (0xFFFFFFFFUL)
#define SDP_PKTBUF_PKTBUF_SHIFT (0U)
#define SDP_PKTBUF_PKTBUF_SET(x) (((uint32_t)(x) << SDP_PKTBUF_PKTBUF_SHIFT) & SDP_PKTBUF_PKTBUF_MASK)
#define SDP_PKTBUF_PKTBUF_GET(x) (((uint32_t)(x) & SDP_PKTBUF_PKTBUF_MASK) >> SDP_PKTBUF_PKTBUF_SHIFT)



/* CIPHIV register group index macro definition */
#define SDP_CIPHIV_CIPHIV0 (0UL)
#define SDP_CIPHIV_CIPHIV1 (1UL)
#define SDP_CIPHIV_CIPHIV2 (2UL)
#define SDP_CIPHIV_CIPHIV3 (3UL)

/* HASWRD register group index macro definition */
#define SDP_HASWRD_HASWRD0 (0UL)
#define SDP_HASWRD_HASWRD1 (1UL)
#define SDP_HASWRD_HASWRD2 (2UL)
#define SDP_HASWRD_HASWRD3 (3UL)
#define SDP_HASWRD_HASWRD4 (4UL)
#define SDP_HASWRD_HASWRD5 (5UL)
#define SDP_HASWRD_HASWRD6 (6UL)
#define SDP_HASWRD_HASWRD7 (7UL)


#endif /* HPM_SDP_H */
